apache/nuttx/arch/mips/src/pic32mx/chip.h
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       4   /* 4 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  define CHIP_CVR          1   /* Have comparator voltage reference */
#  define CHIP_TRACE        1   /* Have trace capability */
#  define CHIP_NEUARTS      6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    tbd
#  define CHIP_NSPI         4   /* 4 SPI interfaces */
#  define CHIP_NI2C         5   /* 5 I2C interfaces */
#  define CHIP_NCAN         0   /* No CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernett interface */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX664F128L)
#  undef  CHIP_PIC32MX3
#  define CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  undef  CHIP_PIC32MX6     1
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        100 /* Package PT,PF,BG */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 128 /* 128Kb program FLASH */
#  define CHIP_DATAMEM_KB   32  /* 32Kb data memory */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       4   /* 4 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  define CHIP_CVR          1   /* Have comparator voltage reference */
#  define CHIP_TRACE        1   /* Have trace capability */
#  define CHIP_NEUARTS      6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    tbd
#  define CHIP_NSPI         4   /* 4 SPI interfaces */
#  define CHIP_NI2C         5   /* 5 I2C interfaces */
#  define CHIP_NCAN         0   /* No CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernett interface */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX675F256L)
#  undef  CHIP_PIC32MX3
#  define CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  undef  CHIP_PIC32MX6     1
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        100 /* Package PT,PF,BG */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 256 /* 256Kb program FLASH */
#  define CHIP_DATAMEM_KB   64  /* 64Kb data memory */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       8   /* 8 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  undef  CHIP_CVR              /* No comparator voltage reference */
#  define CHIP_TRACE        1   /* Have trace capability */
#  define CHIP_NEUARTS      6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    tbd
#  define CHIP_NSPI         4   /* 4 SPI interfaces */
#  define CHIP_NI2C         5   /* 5 I2C interfaces */
#  define CHIP_NCAN         0   /* No CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernett interface */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX675F512L)
#  undef  CHIP_PIC32MX3
#  define CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  undef  CHIP_PIC32MX6     1
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        100 /* Package PT,PF,BG */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 512 /* 512Kb program FLASH */
#  define CHIP_DATAMEM_KB   64  /* 64Kb data memory */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       8   /* 8 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  undef  CHIP_CVR              /* No comparator voltage reference */
#  define CHIP_TRACE        1   /* Have trace capability */
#  define CHIP_NEUARTS      6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    tbd
#  define CHIP_NSPI         4   /* 4 SPI interfaces */
#  define CHIP_NI2C         5   /* 5 I2C interfaces */
#  define CHIP_NCAN         0   /* No CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernett interface */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX695F512L)
#  undef  CHIP_PIC32MX3
#  define CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  undef  CHIP_PIC32MX6     1
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        100 /* Package PT,PF,BG */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 512 /* 512Kb program FLASH */
#  define CHIP_DATAMEM_KB   128 /* 128Kb data memory */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       8   /* xx programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  define CHIP_CVR          1   /* Have comparator voltage reference */
#  define CHIP_TRACE        1   /* Have trace capability */
#  define CHIP_NEUARTS      6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    tbd
#  define CHIP_NSPI         4   /* 4 SPI interfaces */
#  define CHIP_NI2C         5   /* 5 I2C interfaces */
#  define CHIP_NCAN         0   /* No CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernett interface */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX764F128H)
#  undef  CHIP_PIC32MX3
#  define CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7     1
#  define CHIP_NPINS        64  /* Package PT,MR */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 128 /* 128Kb program FLASH */
#  define CHIP_DATAMEM_KB   32  /* 32Kb data memory */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       4   /* 4 programmable DMA channels (6 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  define CHIP_CVR          1   /* Have comparator voltage reference */
#  undef  CHIP_TRACE            /* No trace capability */
#  define CHIP_NEUARTS      6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    tbd
#  define CHIP_NSPI         3   /* 3 SPI interfaces */
#  define CHIP_NI2C         4   /* 4 I2C interfaces */
#  define CHIP_NCAN         1   /* 1 CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernett interface */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX775F256H)
#  undef  CHIP_PIC32MX3
#  define CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7     1
#  define CHIP_NPINS        64  /* Package PT,MR */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 256 /* 256Kb program FLASH */
#  define CHIP_DATAMEM_KB   64  /* 64Kb data memory */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       8   /* 8 programmable DMA channels (8 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  undef  CHIP_CVR              /* No comparator voltage reference */
#  undef  CHIP_TRACE            /* No trace capability */
#  define CHIP_NEUARTS      6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    tbd
#  define CHIP_NSPI         3   /* 3 SPI interfaces */
#  define CHIP_NI2C         4   /* 4 I2C interfaces */
#  define CHIP_NCAN         2   /* 2 CAN interfaces */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernet interface */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX775F512H)
#  undef  CHIP_PIC32MX3
#  define CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7     1
#  define CHIP_NPINS        64  /* Package PT,MR */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 512 /* 512Kb program FLASH */
#  define CHIP_DATAMEM_KB   64  /* 64Kb data memory */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       8   /* 8 programmable DMA channels (8 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  undef  CHIP_CVR              /* No comparator voltage reference */
#  undef  CHIP_TRACE            /* No trace capability */
#  define CHIP_NEUARTS      6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    tbd
#  define CHIP_NSPI         3   /* 3 SPI interfaces */
#  define CHIP_NI2C         4   /* 4 I2C interfaces */
#  define CHIP_NCAN         2   /* 2 CAN interfaces */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernet interface */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX795F512H)
#  undef  CHIP_PIC32MX3
#  define CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7     1
#  define CHIP_NPINS        64  /* Package PT,MR */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 512 /* 512Kb program FLASH */
#  define CHIP_DATAMEM_KB   128 /* 128Kb data memory */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       8   /* 8 programmable DMA channels (8 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  define CHIP_CVR          1   /* Have comparator voltage reference */
#  undef  CHIP_TRACE            /* No trace capability */
#  define CHIP_NEUARTS      6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    tbd
#  define CHIP_NSPI         3   /* 3 SPI interfaces */
#  define CHIP_NI2C         4   /* 4 I2C interfaces */
#  define CHIP_NCAN         2   /* 2 CAN interfaces */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernet interface */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX764F128L)
#  undef  CHIP_PIC32MX3
#  define CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7     1
#  define CHIP_NPINS        100 /* Package  PT,PF,BG */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 128 /* 128Kb program FLASH */
#  define CHIP_DATAMEM_KB   32  /* 32Kb data memory */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       4   /* 4 programmable DMA channels (6 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  define CHIP_CVR          1   /* Have comparator voltage reference */
#  define CHIP_TRACE        1   /* Have trace capability */
#  define CHIP_NEUARTS      6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    tbd
#  define CHIP_NSPI         4   /* 4 SPI interfaces */
#  define CHIP_NI2C         5   /* 5 I2C interfaces */
#  define CHIP_NCAN         1   /* 1 CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernet interface */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX775F256L)
#  undef  CHIP_PIC32MX3
#  define CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7     1
#  define CHIP_NPINS        100 /* Package PT,PF,BG */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 256 /* 256Kb program FLASH */
#  define CHIP_DATAMEM_KB   64  /* 64Kb data memory */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       8   /* 8 programmable DMA channels (8 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  undef  CHIP_CVR              /* No comparator voltage reference */
#  define CHIP_TRACE        1   /* Have trace capability */
#  define CHIP_NEUARTS      6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    tbd
#  define CHIP_NSPI         4   /* 4 SPI interfaces */
#  define CHIP_NI2C         5   /* 5 I2C interfaces */
#  define CHIP_NCAN         2   /* 2 CAN interfaces */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernet interface */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX775F512L)
#  undef  CHIP_PIC32MX3
#  define CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7     1
#  define CHIP_NPINS        100 /* Package PT,PF,BG */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 512 /* 512Kb program FLASH */
#  define CHIP_DATAMEM_KB   64  /* 64Kb data memory */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       8   /* 8 programmable DMA channels (8 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  undef  CHIP_CVR              /* No comparator voltage reference */
#  define CHIP_TRACE        1   /* Have trace capability */
#  define CHIP_NEUARTS      6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    tbd
#  define CHIP_NSPI         4   /* 4 SPI interfaces */
#  define CHIP_NI2C         5   /* 5 I2C interfaces */
#  define CHIP_NCAN         2   /* 2 CAN interfaces */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernet interface */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX795F512L)
#  undef  CHIP_PIC32MX3
#  define CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7     1
#  define CHIP_NPINS        100 /* Package PT,PF,BG */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 512 /* 512Kb program FLASH */
#  define CHIP_DATAMEM_KB   128 /* 128Kb data memory */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       8   /* 8 programmable DMA channels (8 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  define CHIP_CVR          1   /* Have comparator voltage reference */
#  define CHIP_TRACE        1   /* Have trace capability */
#  define CHIP_NEUARTS      6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    tbd
#  define CHIP_NSPI         4   /* 4 SPI interfaces */
#  define CHIP_NI2C         5   /* 5 I2C interfaces */
#  define CHIP_NCAN         2   /* 2 CAN interfaces */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernet interface */
#  define CHIP_JTAG
#else
#  error "Unrecognized PIC32 device
#endif

/****************************************************************************
 * Public Types
 ****************************************************************************/

#ifndef __ASSEMBLY__

/****************************************************************************
 * Inline Functions
 ****************************************************************************/

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

#ifdef __cplusplus
#define EXTERN extern "C"
extern "C" {
#else
#define EXTERN extern
#endif

#undef EXTERN
#ifdef __cplusplus
}
#endif

#endif /* __ASSEMBLY__ */
#endif /* __ARCH_MIPS_SRC_PIC32MX_CHIP_H */
